<a href="https://colab.research.google.com/github/dr-rompecabezas/demographic-data-analyzer/blob/master/demographic_data_analyzer.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Assignment

# Demographic Data Analyzer

In this challenge you must analyze demographic data using Pandas. You are given a dataset of demographic data that was extracted from the 1994 Census database. Here is a sample of what the data looks like:

|    |   age | workclass        |   fnlwgt | education   |   education-num | marital-status     | occupation        | relationship   | race   | sex    |   capital-gain |   capital-loss |   hours-per-week | native-country   | salary   |
|---:|------:|:-----------------|---------:|:------------|----------------:|:-------------------|:------------------|:---------------|:-------|:-------|---------------:|---------------:|-----------------:|:-----------------|:---------|
|  0 |    39 | State-gov        |    77516 | Bachelors   |              13 | Never-married      | Adm-clerical      | Not-in-family  | White  | Male   |           2174 |              0 |               40 | United-States    | <=50K    |
|  1 |    50 | Self-emp-not-inc |    83311 | Bachelors   |              13 | Married-civ-spouse | Exec-managerial   | Husband        | White  | Male   |              0 |              0 |               13 | United-States    | <=50K    |
|  2 |    38 | Private          |   215646 | HS-grad     |               9 | Divorced           | Handlers-cleaners | Not-in-family  | White  | Male   |              0 |              0 |               40 | United-States    | <=50K    |
|  3 |    53 | Private          |   234721 | 11th        |               7 | Married-civ-spouse | Handlers-cleaners | Husband        | Black  | Male   |              0 |              0 |               40 | United-States    | <=50K    |
|  4 |    28 | Private          |   338409 | Bachelors   |              13 | Married-civ-spouse | Prof-specialty    | Wife           | Black  | Female |              0 |              0 |               40 | Cuba             | <=50K    |


You must use Pandas to answer the following questions:
* How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels. (`race` column)
* What is the average age of men?
* What is the percentage of people who have a Bachelor's degree?
* What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?
* What percentage of people without advanced education make more than 50K?
* What is the minimum number of hours a person works per week?
* What percentage of the people who work the minimum number of hours per week have a salary of more than 50K?
* What country has the highest percentage of people that earn >50K and what is that percentage?
* Identify the most popular occupation for those who earn >50K in India. 

Use the starter code in the file `demographic_data_anaylizer`. Update the code so all variables set to "None" are set to the appropriate calculation or code. Round all decimals to the nearest tenth.

### Dataset Source

Dua, D. and Graff, C. (2019). UCI Machine Learning Repository [http://archive.ics.uci.edu/ml]. Irvine, CA: University of California, School of Information and Computer Science.

In [5]:
import pandas as pd

In [6]:
# Read data from file
df = pd.read_csv('adult.data.csv')

In [7]:
# How many of each race are represented in this dataset? 
# This should be a Pandas series with race names as the index labels.
race_count = df['race'].value_counts()

In [8]:
race_count

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

In [9]:
df.groupby('sex').age.mean()

sex
Female    36.858230
Male      39.433547
Name: age, dtype: float64

In [10]:
df.query("sex=='Male'").age.mean()

39.43354749885268

In [11]:
# What is the average age of men?
average_age_men = round(df.query("sex=='Male'").age.mean(), 1)
average_age_men

39.4

In [12]:
df.loc[df['education-num'] >= 13, ['education', 'education-num', 'salary']]

         education  education-num salary
0        Bachelors             13  <=50K
1        Bachelors             13  <=50K
4        Bachelors             13  <=50K
5          Masters             14  <=50K
8          Masters             14   >50K
...            ...            ...    ...
32539    Doctorate             16   >50K
32544      Masters             14  <=50K
32548  Prof-school             15  <=50K
32553      Masters             14  <=50K
32554      Masters             14   >50K

[8067 rows x 3 columns]

In [13]:
df['salary'].value_counts()

<=50K    24720
>50K      7841
Name: salary, dtype: int64

In [15]:
df[['education', 'education-num']].value_counts()

education     education-num
HS-grad       9                10501
Some-college  10                7291
Bachelors     13                5355
Masters       14                1723
Assoc-voc     11                1382
11th          7                 1175
Assoc-acdm    12                1067
10th          6                  933
7th-8th       4                  646
Prof-school   15                 576
9th           5                  514
12th          8                  433
Doctorate     16                 413
5th-6th       3                  333
1st-4th       2                  168
Preschool     1                   51
dtype: int64

In [41]:
bmd_bool = ((df['education-num'] == 13) | (df['education-num'] == 14) | (df['education-num'] == 16))
bmd_bool

0         True
1         True
2        False
3        False
4         True
         ...
32556    False
32557    False
32558    False
32559    False
32560    False
Name: education-num, Length: 32561, dtype: bool

In [20]:
bmd = df.loc[(df['education-num'] == 13) | (df['education-num'] == 14) | (df['education-num'] == 16)]
bmd.head(3)

   age         workclass  fnlwgt  ... hours-per-week  native-country salary
0   39         State-gov   77516  ...             40   United-States  <=50K
1   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
4   28           Private  338409  ...             40            Cuba  <=50K

[3 rows x 15 columns]

In [42]:
bmd_over50K = df.loc[ bmd_bool & (df['salary'] == '>50K')]
bmd_over50K.head(3)

    age  workclass  fnlwgt  ... hours-per-week  native-country salary
8    31    Private   45781  ...             50   United-States   >50K
9    42    Private  159449  ...             40   United-States   >50K
11   30  State-gov  141297  ...             40           India   >50K

[3 rows x 15 columns]

In [47]:
(df.loc[ bmd_bool & (df['salary'] == '>50K')].count()/df.loc[bmd_bool].count()).mean()

0.46535843011613937

In [43]:
(bmd_over50K.count()/bmd.count()*100).mean()

46.53584301161392

In [48]:
# What is the percentage of people who have a Bachelor's degree?
percentage_bachelors = round( (df.loc[df['education'] == 'Bachelors'].count()/df['education'].count()*100).mean(), 1)

# What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?
# What percentage of people without advanced education make more than 50K?

# with and without `Bachelors`, `Masters`, or `Doctorate`
higher_education = ((df['education-num'] == 13) | (df['education-num'] == 14) | (df['education-num'] == 16))
lower_education = ((df['education-num'] < 13) | (df['education-num'] == 15))

# percentage with salary >50K
higher_education_rich = round((df.loc[ higher_education & (df['salary'] == '>50K')].count()/df.loc[higher_education].count()*100).mean(), 1)
lower_education_rich = round((df.loc[ lower_education & (df['salary'] == '>50K')].count()/df.loc[lower_education].count()*100).mean(), 1)

In [50]:
print(percentage_bachelors, '%')
print(higher_education_rich, '%')
print(lower_education_rich, '%')

16.4 %
46.5 %
17.4 %

In [51]:
df.head(1)

   age  workclass  fnlwgt  ... hours-per-week  native-country salary
0   39  State-gov   77516  ...             40   United-States  <=50K

[1 rows x 15 columns]

In [53]:
df['hours-per-week'].value_counts()

40    15217
50     2819
45     1824
60     1475
35     1297
      ...
92        1
94        1
87        1
74        1
82        1
Name: hours-per-week, Length: 94, dtype: int64

In [54]:
df['hours-per-week'].min()

1

In [55]:
# What is the minimum number of hours a person works per week 
# (hours-per-week feature)?
min_work_hours = df['hours-per-week'].min()

In [61]:
(df.loc[df['hours-per-week'] == 1].count()).mean()

20.0

In [63]:
onehourworkers = df.loc[df['hours-per-week'] == 1].count()

In [67]:
(df.loc[(df['hours-per-week'] == 1) & (df['salary'] == '>50K')].count()/onehourworkers*100).mean()

10.0

In [73]:
# What percentage of the people who work the minimum number of hours per week 
# have a salary of >50K?
num_min_workers = df.loc[df['hours-per-week'] == 1].count()
rich_percentage = round((df.loc[(df['hours-per-week'] == 1) & (df['salary'] == '>50K')].count()/num_min_workers*100).mean())

In [74]:
print(rich_percentage, '%')

10 %

In [75]:
df.head(1)

   age  workclass  fnlwgt  ... hours-per-week  native-country salary
0   39  State-gov   77516  ...             40   United-States  <=50K

[1 rows x 15 columns]

In [101]:
df.loc[df['salary'] == '>50K', 'native-country'].value_counts()

United-States         7171
?                      146
Philippines             61
Germany                 44
India                   40
Canada                  39
Mexico                  33
England                 30
Cuba                    25
Italy                   25
Japan                   24
Taiwan                  20
China                   20
Iran                    18
South                   16
France                  12
Poland                  12
Puerto-Rico             12
Jamaica                 10
El-Salvador              9
Greece                   8
Cambodia                 7
Yugoslavia               6
Hong                     6
Vietnam                  5
Ireland                  5
Portugal                 4
Haiti                    4
Ecuador                  4
Guatemala                3
Thailand                 3
Hungary                  3
Scotland                 3
Dominican-Republic       2
Columbia                 2
Peru                     2
Trinadad&Tobago          2
Nicaragua                2
Laos                     2
Honduras                 1
Name: native-country, dtype: int64

In [102]:
df['native-country'].value_counts()

United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Cambodia                         19
Trinadad&Tobago                  19
Thailand                         18
Laos                             18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Hungary                          13
Honduras                         13
Scotland                         12
Holand-Netherlands                1
Name: native-country, dtype: int64

In [117]:
(df.loc[df['salary'] == '>50K', 'native-country'].value_counts()) / df['native-country'].value_counts()

?                             0.250429
Cambodia                      0.368421
Canada                        0.322314
China                         0.266667
Columbia                      0.033898
Cuba                          0.263158
Dominican-Republic            0.028571
Ecuador                       0.142857
El-Salvador                   0.084906
England                       0.333333
France                        0.413793
Germany                       0.321168
Greece                        0.275862
Guatemala                     0.046875
Haiti                         0.090909
Holand-Netherlands                 NaN
Honduras                      0.076923
Hong                          0.300000
Hungary                       0.230769
India                         0.400000
Iran                          0.418605
Ireland                       0.208333
Italy                         0.342466
Jamaica                       0.123457
Japan                         0.387097
Laos                          0.111111
Mexico                        0.051322
Nicaragua                     0.058824
Outlying-US(Guam-USVI-etc)         NaN
Peru                          0.064516
Philippines                   0.308081
Poland                        0.200000
Portugal                      0.108108
Puerto-Rico                   0.105263
Scotland                      0.250000
South                         0.200000
Taiwan                        0.392157
Thailand                      0.166667
Trinadad&Tobago               0.105263
United-States                 0.245835
Vietnam                       0.074627
Yugoslavia                    0.375000
Name: native-country, dtype: float64

In [110]:
((df.loc[df['salary'] == '>50K', 'native-country'].value_counts()) / df['native-country'].value_counts()).idxmax()

'Iran'

In [112]:
((df.loc[df['salary'] == '>50K', 'native-country'].value_counts()) / df['native-country'].value_counts() *100).max()

41.86046511627907

In [115]:
# What country has the highest percentage of people that earn >50K?
highest_earning_country = ((df.loc[df['salary'] == '>50K', 'native-country'].value_counts()) / df['native-country'].value_counts()).idxmax()
highest_earning_country_percentage = round(((df.loc[df['salary'] == '>50K', 'native-country'].value_counts()) / df['native-country'].value_counts() *100).max(), 1)

In [116]:
print(highest_earning_country)
print(highest_earning_country_percentage)

Iran
41.9

In [123]:
(df.loc[(df['native-country'] == 'India') & (df['salary'] == '>50K'), 'occupation'].value_counts()).idxmax()

'Prof-specialty'

In [124]:
# Identify the most popular occupation for those who earn >50K in India.
top_IN_occupation = (df.loc[(df['native-country'] == 'India') & (df['salary'] == '>50K'), 'occupation'].value_counts()).idxmax()
print(top_IN_occupation)

Prof-specialty